Repository: DarkSpot5/Donate2Save
Catalog: lib/l10n/intl_*.arb
Languages: ur

# registerTitle
source: Register
ur: رجسٹر

# emailLabel
source: Email
ur: ای میل

# registerCreateAccount
source: Create Account
ur: اکاؤنٹ بنائیں

# passwordLabel
source: Password
ur: پاس ورڈ

# confirmPasswordLabel
source: Confirm Password
ur: پاس ورڈ کی تصدیق کریں

# selectRoleLabel
source: Select Role
ur: کردار منتخب کریں

# registerButton
source: Register
ur: رجسٹر

source: Forgot Password
ur: پاس ورڈ بھول گئے

source: Reset Your Password
ur: اپنا پاس ورڈ دوبارہ ترتیب دیں

# emailSentTitle
source: Email Sent
ur: ای میل بھیج دی

source: Send Reset Email
ur: ری سیٹ ای میل بھیجیں

# resetEmailSent
source: Password reset email sent successfully.
ur: پاس ورڈ ری سیٹ ای میل بھیج دی گئی ہے۔

# appTitle
source: Donate2Save
ur: ڈونیٹ 2 سیو

# appSubtitle
source: Health Care
ur: ہیلتھ کیئر

# forgotPasswordLink
source: Forgot Password?
ur: پاس ورڈ بھول گئے؟

# loginButton
source: Login
ur: لاگ اِن

# orDivider
source: or
ur: یا

# emailVerificationTitle
source: Email Verification
ur: ای میل کی تصدیق

# emailVerificationTextTitle
source: A verification link has been sent to your email.
ur: آپ کی ای میل پر ایک تصدیقی لنک بھیج دیا گیا ہے۔

# emailVerificationTextSubtitle
source: Please check your inbox and click on the verification link. If you do not see the email, please check your spam folder.
ur: براہ کرم اپنے ان باکس کو چیک کریں اور تصدیقی لنک پر کلک کریں۔ اگر آپ کو ای میل نظر نہیں آتی تو براہ کرم اپنے سپیم فولڈر کو چیک کریں۔

# emailVerificationsent
source: verification email has been sent.
ur: تصدیقی ای میل بھیج دی گئی ہے۔

source: I verified My Email
ur: میں نے تصدیق کر لی ہے

source: Resend Verification Email
ur: تصدیقی ای میل دوبارہ بھیجیں

# verifiedTitle
source: Verified
ur: تصدیق شدہ

# verifiedSubtitle
source: Your email has been verified successfully. You can now proceed to set up your profile.
ur: آپ کی ای میل کامیابی سے تصدیق ہو گئی ہے۔ آپ اب اپنے پروفائل کو ترتیب دینے کے لیے آگے بڑھ سکتے ہیں.

# notVerifiedTitle
source: Email Not Verified
ur: ای میل تصدیق نہیں ہوئی

# notVerifiedSubtitle
source: Your email is not verified. Please check your inbox for the verification link.
ur: آپ کی ای میل کی تصدیق نہیں ہوئی ہے۔ براہ کرم تصدیقی لنک کے لیے اپنے ان باکس کو چیک کریں۔

# userNameLabel
source: User Name
ur: صارف کا نام

# bloodGroupLabel
source: Blood Group
ur: خون کا گروپ

# genderLabel
source: Gender
ur: جنس

# maleLabel
source: Male
ur: مرد

# femaleLabel
source: Female
ur: عورت

# otherLabel
source: Other
ur: دیگر

# hospitalNameLabel
source: Hospital Name
ur: ہسپتال کا نام

source: Initial Blood Stock
ur: ابتدائی خون کا ذخیرہ

# setupProfileTitle
source: Setup Profile
ur: پروفائل کی ترتیب

# contactNumberLabel
source: Contact Number
ur: رابطہ نمبر

# locationLabel
source: Location
ur: پتہ

# saveProfileButton
source: Save Profile
ur: پروفائل محفوظ کریں

# searchHint
source: Search hospitals
ur: ہسپتال تلاش کریں

# noNotifications
source: No new notifications.
ur: کوئی نئی اطلاعات نہیں

# errorAllFieldsRequired
source: All fields are required.
ur: تمام فیلڈز کا پُر کرنا ضروری ہے۔

# errorEnterEmail
source: Please enter your email address.
ur: براہ کرم اپنا ای میل ایڈریس درج کریں۔

# errorInvalidEmail
source: Please enter a valid email address.
ur: براہ کرم درست ای میل ایڈریس درج کریں۔

# errorPasswordsDoNotMatch
source: Passwords do not match.
ur: پاس ورڈ مماثل نہیں ہیں۔

# errorPasswordTooShort
source: Password must be at least 8 characters long.
ur: پاس ورڈ کم از کم 8 حروف پر مشتمل ہونا چاہیے۔

# errorPasswordRequirements
source: Password must contain uppercase, lowercase, number, and special character.
ur: پاس ورڈ میں بڑا حرف، چھوٹا حرف، نمبر، اور خصوصی حرف ہونا ضروری ہے۔

# errorRoleNotSelected
source: Please select a role.
ur: براہ کرم کردار منتخب کریں۔

# errorEnterName
source: Please enter the Name
ur: براہ کرم نام درج کریں

# errorEnterHospitalName
source: Please enter the Hospital Name
ur: براہ کرم ہسپتال کا نام درج کریں

# errorEnterContact
source: Please enter the Contact Number
ur: براہ کرم رابطہ نمبر درج کریں

# errorInvalidContact
source: Enter a valid 11-digit Contact Number
ur: درست 11 ہندسوں پر مشتمل رابطہ نمبر درج کریں

# errorSelectBloodGroup
source: Please select your Blood Group
ur: براہ کرم اپنا بلڈ گروپ منتخب کریں

# errorEnterLocation
source: Please insert your Location
ur: براہ کرم اپنا مقام درج کریں

# errorSelectGender
source: Please select your Gender
ur: براہ کرم اپنی جنس منتخب کریں

# errorEnterBloodStock
source: Please enter quantity for {bloodType}
ur: {bloodType} کے لیے مقدار درج کریں

# errorInvalidBloodStock
source: Enter a valid number for {bloodType}
ur: {bloodType} کے لیے درست نمبر درج کریں

# error_user_null
source: User is null.
ur: صارف موجود نہیں ہے۔

# error_user_not_found
source: User document does not exist.
ur: صارف کی معلومات موجود نہیں ہیں۔

# error_invalid_role
source: Invalid role returned from Firestore.
ur: فائر اسٹور سے غلط کردار واپس آیا۔

# error_failed_to_update_profile
source: Failed to update profile.
ur: پروفائل کو اپ ڈیٹ کرنے میں ناکامی۔

# error_networkRequestFailed
source: Check your internet connection.
ur: اپنے انٹرنیٹ کنکشن کو چیک کریں۔

# error_userDisabled
source: This user has been disabled.
ur: یہ صارف غیر فعال کر دیا گیا ہے۔

# error_tooManyRequests
source: Too many attempts. Try again later.
ur: بہت زیادہ کوششیں کی گئیں۔ بعد میں دوبارہ کوشش کریں۔

# error_userTokenExpired
source: You are no longer authenticated since your refresh token has expired.
ur: آپ کی توثیق ختم ہو گئی ہے کیونکہ ریفریش ٹوکن کی مدت ختم ہو چکی ہے۔

# error_userNotFound
source: No account found with this email.
ur: اس ای میل کے ساتھ کوئی اکاؤنٹ نہیں ملا۔

# error_wrongPassword
source: Incorrect password.
ur: غلط پاس ورڈ۔

# error_emailAlreadyInUse
source: Email already registered. Try logging in.
ur: ای میل پہلے سے رجسٹرڈ ہے۔ براہ کرم لاگ ان کریں۔

# error_invalidEmail
source: Invalid email address.
ur: غلط ای میل ایڈریس۔

# error_weakPassword
source: The password is too weak.
ur: پاس ورڈ بہت کمزور ہے۔

# error_invalidCredentials
source: Invalid Credentials Do you have an account?
ur: غلط معلومات کیا آپ کا اکاؤنٹ ہے؟

# error_missingAndroidPkgName
source: An Android package name must be provided if the Android app is required to be installed.
ur: اگر اینڈرائیڈ ایپ کو انسٹال کرنے کی ضرورت ہو تو پیکیج کا نام لازمی ہے۔

# error_unexpected
source: An unexpected error occurred: {error}
ur: ایک غیر متوقع خرابی پیش آگئی: {error}

# error_default
source: Something went wrong. Please try again.
ur: کچھ غلط ہو گیا ہے۔ براہ کرم دوبارہ کوشش کریں۔

# profile_updated
source: Profile updated successfully.
ur: پروفائل کامیابی سے اپ ڈیٹ ہو گئی ہے۔

# unknownSuccess
source: Unknown success message encountered.
ur: ہمیں ایک نامعلوم کامیابی کا پیغام ملا ہے۔

# languageToggle
source: اردو
ur: English
